grevaillot/svd_tools/headers/STM32G484xx/hrtim_timd.h
/** @defgroup hrtim_timd_cpt2dcr CPT2DCR CPT2xCR
@{*/

/** HRTIM_TIMD_CPT2DCR_TECMP2 Timer E Compare 2 **/
#define HRTIM_TIMD_CPT2DCR_TECMP2		(1 << 31)
/** HRTIM_TIMD_CPT2DCR_TECMP1 Timer E Compare 1 **/
#define HRTIM_TIMD_CPT2DCR_TECMP1		(1 << 30)
/** HRTIM_TIMD_CPT2DCR_TE1RST Timer E output 1 Reset **/
#define HRTIM_TIMD_CPT2DCR_TE1RST		(1 << 29)
/** HRTIM_TIMD_CPT2DCR_TE1SET Timer E output 1 Set **/
#define HRTIM_TIMD_CPT2DCR_TE1SET		(1 << 28)
/** HRTIM_TIMD_CPT2DCR_TFCMP2 TFCMP2 **/
#define HRTIM_TIMD_CPT2DCR_TFCMP2		(1 << 27)
/** HRTIM_TIMD_CPT2DCR_TFCMP1 TFCMP1 **/
#define HRTIM_TIMD_CPT2DCR_TFCMP1		(1 << 26)
/** HRTIM_TIMD_CPT2DCR_TF1RST TF1RST **/
#define HRTIM_TIMD_CPT2DCR_TF1RST		(1 << 25)
/** HRTIM_TIMD_CPT2DCR_TF1SET TF1SET **/
#define HRTIM_TIMD_CPT2DCR_TF1SET		(1 << 24)
/** HRTIM_TIMD_CPT2DCR_TCCMP2 Timer C Compare 2 **/
#define HRTIM_TIMD_CPT2DCR_TCCMP2		(1 << 23)
/** HRTIM_TIMD_CPT2DCR_TCCMP1 Timer C Compare 1 **/
#define HRTIM_TIMD_CPT2DCR_TCCMP1		(1 << 22)
/** HRTIM_TIMD_CPT2DCR_TC1RST Timer C output 1 Reset **/
#define HRTIM_TIMD_CPT2DCR_TC1RST		(1 << 21)
/** HRTIM_TIMD_CPT2DCR_TC1SET Timer C output 1 Set **/
#define HRTIM_TIMD_CPT2DCR_TC1SET		(1 << 20)
/** HRTIM_TIMD_CPT2DCR_TBCMP2 Timer B Compare 2 **/
#define HRTIM_TIMD_CPT2DCR_TBCMP2		(1 << 19)
/** HRTIM_TIMD_CPT2DCR_TBCMP1 Timer B Compare 1 **/
#define HRTIM_TIMD_CPT2DCR_TBCMP1		(1 << 18)
/** HRTIM_TIMD_CPT2DCR_TB1RST Timer B output 1 Reset **/
#define HRTIM_TIMD_CPT2DCR_TB1RST		(1 << 17)
/** HRTIM_TIMD_CPT2DCR_TB1SET Timer B output 1 Set **/
#define HRTIM_TIMD_CPT2DCR_TB1SET		(1 << 16)
/** HRTIM_TIMD_CPT2DCR_TACMP2 Timer A Compare 2 **/
#define HRTIM_TIMD_CPT2DCR_TACMP2		(1 << 15)
/** HRTIM_TIMD_CPT2DCR_TACMP1 Timer A Compare 1 **/
#define HRTIM_TIMD_CPT2DCR_TACMP1		(1 << 14)
/** HRTIM_TIMD_CPT2DCR_TA1RST Timer A output 1 Reset **/
#define HRTIM_TIMD_CPT2DCR_TA1RST		(1 << 13)
/** HRTIM_TIMD_CPT2DCR_TA1SET Timer A output 1 Set **/
#define HRTIM_TIMD_CPT2DCR_TA1SET		(1 << 12)
/** HRTIM_TIMD_CPT2DCR_EXEV10CPT External Event 10 Capture **/
#define HRTIM_TIMD_CPT2DCR_EXEV10CPT		(1 << 11)
/** HRTIM_TIMD_CPT2DCR_EXEV9CPT External Event 9 Capture **/
#define HRTIM_TIMD_CPT2DCR_EXEV9CPT		(1 << 10)
/** HRTIM_TIMD_CPT2DCR_EXEV8CPT External Event 8 Capture **/
#define HRTIM_TIMD_CPT2DCR_EXEV8CPT		(1 << 9)
/** HRTIM_TIMD_CPT2DCR_EXEV7CPT External Event 7 Capture **/
#define HRTIM_TIMD_CPT2DCR_EXEV7CPT		(1 << 8)
/** HRTIM_TIMD_CPT2DCR_EXEV6CPT External Event 6 Capture **/
#define HRTIM_TIMD_CPT2DCR_EXEV6CPT		(1 << 7)
/** HRTIM_TIMD_CPT2DCR_EXEV5CPT External Event 5 Capture **/
#define HRTIM_TIMD_CPT2DCR_EXEV5CPT		(1 << 6)
/** HRTIM_TIMD_CPT2DCR_EXEV4CPT External Event 4 Capture **/
#define HRTIM_TIMD_CPT2DCR_EXEV4CPT		(1 << 5)
/** HRTIM_TIMD_CPT2DCR_EXEV3CPT External Event 3 Capture **/
#define HRTIM_TIMD_CPT2DCR_EXEV3CPT		(1 << 4)
/** HRTIM_TIMD_CPT2DCR_EXEV2CPT External Event 2 Capture **/
#define HRTIM_TIMD_CPT2DCR_EXEV2CPT		(1 << 3)
/** HRTIM_TIMD_CPT2DCR_EXEV1CPT External Event 1 Capture **/
#define HRTIM_TIMD_CPT2DCR_EXEV1CPT		(1 << 2)
/** HRTIM_TIMD_CPT2DCR_UDPCPT Update Capture **/
#define HRTIM_TIMD_CPT2DCR_UDPCPT		(1 << 1)
/** HRTIM_TIMD_CPT2DCR_SWCPT Software Capture **/
#define HRTIM_TIMD_CPT2DCR_SWCPT		(1 << 0)

/**@}*/

/** @defgroup hrtim_timd_outdr OUTDR Timerx Output Register
@{*/

/** HRTIM_TIMD_OUTDR_DIDL2 Output 2 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIMD_OUTDR_DIDL2		(1 << 23)
/** HRTIM_TIMD_OUTDR_CHP2 Output 2 Chopper enable **/
#define HRTIM_TIMD_OUTDR_CHP2		(1 << 22)

#define HRTIM_TIMD_OUTDR_FAULT2_SHIFT		20
#define HRTIM_TIMD_OUTDR_FAULT2_MASK		0x03
/** @defgroup hrtim_timd_outdr_fault2 FAULT2 Output 2 Fault state
@{*/
/**@}*/

/** HRTIM_TIMD_OUTDR_IDLES2 Output 2 Idle State **/
#define HRTIM_TIMD_OUTDR_IDLES2		(1 << 19)
/** HRTIM_TIMD_OUTDR_IDLEM2 Output 2 Idle mode **/
#define HRTIM_TIMD_OUTDR_IDLEM2		(1 << 18)
/** HRTIM_TIMD_OUTDR_POL2 Output 2 polarity **/
#define HRTIM_TIMD_OUTDR_POL2		(1 << 17)
/** HRTIM_TIMD_OUTDR_BIAR Balanced Idle Automatic Resume **/
#define HRTIM_TIMD_OUTDR_BIAR		(1 << 14)

#define HRTIM_TIMD_OUTDR_DLYPRT_SHIFT		10
#define HRTIM_TIMD_OUTDR_DLYPRT_MASK		0x07
/** @defgroup hrtim_timd_outdr_dlyprt DLYPRT Delayed Protection
@{*/
/**@}*/

/** HRTIM_TIMD_OUTDR_DLYPRTEN Delayed Protection Enable **/
#define HRTIM_TIMD_OUTDR_DLYPRTEN		(1 << 9)
/** HRTIM_TIMD_OUTDR_DTEN Deadtime enable **/
#define HRTIM_TIMD_OUTDR_DTEN		(1 << 8)
/** HRTIM_TIMD_OUTDR_DIDL1 Output 1 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIMD_OUTDR_DIDL1		(1 << 7)
/** HRTIM_TIMD_OUTDR_CHP1 Output 1 Chopper enable **/
#define HRTIM_TIMD_OUTDR_CHP1		(1 << 6)

#define HRTIM_TIMD_OUTDR_FAULT1_SHIFT		4
#define HRTIM_TIMD_OUTDR_FAULT1_MASK		0x03
/** @defgroup hrtim_timd_outdr_fault1 FAULT1 Output 1 Fault state
@{*/
/**@}*/

/** HRTIM_TIMD_OUTDR_IDLES1 Output 1 Idle State **/
#define HRTIM_TIMD_OUTDR_IDLES1		(1 << 3)
/** HRTIM_TIMD_OUTDR_IDLEM1 Output 1 Idle mode **/
#define HRTIM_TIMD_OUTDR_IDLEM1		(1 << 2)
/** HRTIM_TIMD_OUTDR_POL1 Output 1 polarity **/
#define HRTIM_TIMD_OUTDR_POL1		(1 << 1)

/**@}*/

/** @defgroup hrtim_timd_fltdr FLTDR Timerx Fault Register
@{*/

/** HRTIM_TIMD_FLTDR_FLTLCK Fault sources Lock **/
#define HRTIM_TIMD_FLTDR_FLTLCK		(1 << 31)
/** HRTIM_TIMD_FLTDR_FLT6EN Fault 6 enable **/
#define HRTIM_TIMD_FLTDR_FLT6EN		(1 << 5)
/** HRTIM_TIMD_FLTDR_FLT5EN Fault 5 enable **/
#define HRTIM_TIMD_FLTDR_FLT5EN		(1 << 4)
/** HRTIM_TIMD_FLTDR_FLT4EN Fault 4 enable **/
#define HRTIM_TIMD_FLTDR_FLT4EN		(1 << 3)
/** HRTIM_TIMD_FLTDR_FLT3EN Fault 3 enable **/
#define HRTIM_TIMD_FLTDR_FLT3EN		(1 << 2)
/** HRTIM_TIMD_FLTDR_FLT2EN Fault 2 enable **/
#define HRTIM_TIMD_FLTDR_FLT2EN		(1 << 1)
/** HRTIM_TIMD_FLTDR_FLT1EN Fault 1 enable **/
#define HRTIM_TIMD_FLTDR_FLT1EN		(1 << 0)

/**@}*/

/** @defgroup hrtim_timd_timdcr2 TIMDCR2 HRTIM Timerx Control Register 2
@{*/

/** HRTIM_TIMD_TIMDCR2_TRGHLF Triggered-half mode **/
#define HRTIM_TIMD_TIMDCR2_TRGHLF		(1 << 20)
/** HRTIM_TIMD_TIMDCR2_GTCMP3 Greater than Compare 3 PWM mode **/
#define HRTIM_TIMD_TIMDCR2_GTCMP3		(1 << 17)
/** HRTIM_TIMD_TIMDCR2_GTCMP1 Greater than Compare 1 PWM mode **/
#define HRTIM_TIMD_TIMDCR2_GTCMP1		(1 << 16)

#define HRTIM_TIMD_TIMDCR2_FEROM_SHIFT		14
#define HRTIM_TIMD_TIMDCR2_FEROM_MASK		0x03
/** @defgroup hrtim_timd_timdcr2_ferom FEROM Fault and Event Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMD_TIMDCR2_BMROM_SHIFT		12
#define HRTIM_TIMD_TIMDCR2_BMROM_MASK		0x03
/** @defgroup hrtim_timd_timdcr2_bmrom BMROM Burst Mode Roll-Over Mode
@{*/
/**@}*/


