grevaillot/svd_tools/headers/STM32G484xx/hrtim_timd.h
#define HRTIM_TIMD_TIMDCR2_ADROM_SHIFT		10
#define HRTIM_TIMD_TIMDCR2_ADROM_MASK		0x03
/** @defgroup hrtim_timd_timdcr2_adrom ADROM ADC Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMD_TIMDCR2_OUTROM_SHIFT		8
#define HRTIM_TIMD_TIMDCR2_OUTROM_MASK		0x03
/** @defgroup hrtim_timd_timdcr2_outrom OUTROM Output Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIMD_TIMDCR2_ROM_SHIFT		6
#define HRTIM_TIMD_TIMDCR2_ROM_MASK		0x03
/** @defgroup hrtim_timd_timdcr2_rom ROM Roll-Over Mode
@{*/
/**@}*/

/** HRTIM_TIMD_TIMDCR2_UDM Up-Down Mode **/
#define HRTIM_TIMD_TIMDCR2_UDM		(1 << 4)
/** HRTIM_TIMD_TIMDCR2_DCDR Dual Channel DAC Reset trigger **/
#define HRTIM_TIMD_TIMDCR2_DCDR		(1 << 2)
/** HRTIM_TIMD_TIMDCR2_DCDS Dual Channel DAC Step trigger **/
#define HRTIM_TIMD_TIMDCR2_DCDS		(1 << 1)
/** HRTIM_TIMD_TIMDCR2_DCDE Dual Channel DAC trigger enable **/
#define HRTIM_TIMD_TIMDCR2_DCDE		(1 << 0)

/**@}*/

/** @defgroup hrtim_timd_deefr3 DEEFR3 HRTIM Timerx External Event Filtering Register 3
@{*/


#define HRTIM_TIMD_DEEFR3_EEVACNT_SHIFT		8
#define HRTIM_TIMD_DEEFR3_EEVACNT_MASK		0x3f
/** @defgroup hrtim_timd_deefr3_eevacnt EEVACNT External Event A counter
@{*/
/**@}*/


#define HRTIM_TIMD_DEEFR3_EEVASEL_SHIFT		4
#define HRTIM_TIMD_DEEFR3_EEVASEL_MASK		0x0f
/** @defgroup hrtim_timd_deefr3_eevasel EEVASEL External Event A Selection
@{*/
/**@}*/

/** HRTIM_TIMD_DEEFR3_EEVARSTM External Event A Reset Mode **/
#define HRTIM_TIMD_DEEFR3_EEVARSTM		(1 << 2)
/** HRTIM_TIMD_DEEFR3_EEVACRES External Event A Counter Reset **/
#define HRTIM_TIMD_DEEFR3_EEVACRES		(1 << 1)
/** HRTIM_TIMD_DEEFR3_EEVACE External Event A Counter Enable **/
#define HRTIM_TIMD_DEEFR3_EEVACE		(1 << 0)

/**@}*/
